import React from 'react';
import a from '../assets/dogys.jpg';
import b from '../assets/dogss.jpg';
import d from '../assets/doddd.jpg';
import './Pages.css';
import { motion } from 'framer-motion';

const blog = () => {
  return (
    <motion.div
    initial={{ opacity: 0, y: -50 }}
    animate={{ opacity: 1, y: 0 }}
    exit={{ opacity: 0, y: -50 }}
    transition={{ duration: 0.5 }}
  >
   <div className="home-containerBlog">
      <div className="image-column2">
            <img src={a} alt="My" className='blogphoto'/>
            </div>

            <div className="text-column2">

            <motion.h1
            initial={{ opacity: 0, x: -100 }}
            animate={{ opacity: 1, x: 0 }}
            transition={{ duration: 1 }}
          >
            ვაქცინაცია ძაღლებში
          </motion.h1>
          <motion.p
            initial={{ opacity: 0, x: 100 }}
            animate={{ opacity: 1, x: 0 }}
            transition={{ duration: 1 }}
          >
ვსაუბრობთ აცრებზე
თავდაპირველად განვიხილოთ რა არის აცრა ?

აცრა არის ის , რაც ორგანიზმს აიძულებს გამოიმუშაოს ანტისხეულები დაავადებების წინააღმდეგ . მნიშვნელოვანია ძაღლი აცრილი იყოს ცოფზე და ჩატარებული ჰქონდეს 
კომპლექსური აცრები . შემდეგ კი რეკომენდირებულია ყოველ ერთ წელიწადში ერთხელ ერთი კომპლექსური აცრის ჩატარება . კომპლექსური აცრები ძაღლს იცავს: ჭირისგან,
ენტერიტისგან, ადენოვირუსისგან და ა.შ
მაგრამ აღსანიშნავია ხარისხი , თუ რომელ აცრას გავუკეთებთ . მნიშვნელოვანია რომ აცრები ჩაუტარდეს ჯანმრთელ ძაღლს . ძაღლი თუ ავად არის ან აქვს რამე ვირუსი აცრა დაუშვებელია , რომ ორგანიზმი ზედმეტად არ დაიტვირთოს . ასევე თუ ძაღლს აქვს კვების პრობლემები და კუჭში ცუდად გადის გადადეთ აცრა . აცრამდე ასავე აუცილებელია ლეკვის ჭიებზე ორჯერადად დამუშავება . ჭიის წამალი პირველად ლეკვს ეძლევა 25 დღის ასაკში . ყველაზე ადრე ვაქცინაცია 6 კვირიდან იწყება . მაგრამ გააჩნია რომელი ვაქცინით ავიცრებით . ამ მიზეზის გამო ვაქცინებს შორის ინტერვალიც განსხვავდება . ზოგ ვაქცინას 2 კვირა აქვს ინტერვალი. ევროპულ ვაქცინას 3-4 კვირა აქვს ინტერვალი . ვაქცინაცია უნდა ჩატარდეს 3 ჯერ თუ აცრა იწყება 1,5 თვიდან . თუ აცრა იწვება 2 თვის ასაკში და ვცრით ამერიკული ვაქცინით მაშინ ორჯერადი ვაქცინაციაც საკმარისია. ვაქცინა იცავს ძაღლს , მაგრამ არ გვაძლევს 100% გარანტიას რომ ძაღლს მოცემული დაავადება არ შეხვდება .

გახსოვდეთ რომ საქართველოში დაავადებები ძალიან არის გავცელებული და მუდმივად ვებრძვით დაავადებებს . ამიტომ აირჩიეთ ცნობილი ბრენდის სანდო ვაქცინაცია . ისინი კი უფრო ძვირი ღირს მაგრამ ვიტყოდი, რომ ეკონომია ვაქცინაზე არ ღირს.
          </motion.p>
      </div> 
      </div>




      <div className="home-containerBlog">
      <div className="image-column2">
            <img src={b} alt="My" className='blogphoto'/>
            </div>

            <div className="text-column2">

            <motion.h1
            initial={{ opacity: 0, x: -100 }}
            animate={{ opacity: 1, x: 0 }}
            transition={{ duration: 1 }}
          >
            ვარჯიში
          </motion.h1>
          <motion.p
            initial={{ opacity: 0, x: 100 }}
            animate={{ opacity: 1, x: 0 }}
            transition={{ duration: 1 }}
          >
 ვსაუბრობთ ძაღლის ვარჯიშზე
კუნთოვანი მასის ასაშენებლად და გასაძლიერებლად საჭირო ფიზიკური ვარჯიშების შესრულების გარდა , არსებობს კიდევ ორი ​​მნიშვნელოვანი კომპონენტი პირველი ეს არის დასვენება და აღდგენა , მეორე ხარისხიანი კვება.

მნიშვნელოვანია, რომ არ გადააჭარბო ძაღლის ვარჯიში და ნელ-ნელა გაზარდო წინააღმდეგობა და აქტივობები ანუ ვარჯიშები . მიაქციე ინტერვალებს დიდი ყურადღება , დასვენების დრომ საშუალება უნდა მისცეს მას სრულად აღიდგინოს ენერგია ვარჯიშებს შორის.

დიეტას (სწორ კვებას ) ასევე დიდი მნიშვნელობა აქვს, განსაკუთრებით მაღალი ხარისხის ცილები უნდა მისცე ამ დროს და სწორი რაოდენობით ცხიმები . ცილა მნიშვნელოვანია კუნთების და სხვა ქსოვილების აღსადგენად . ასევე ის აშენებს კუნთებს . ის საჭიროა კანის ახალი უჯრედების ფორმირებისთვისაც და ჯანსაღი ბეწვისთვის . სწორად სწორი კვების შემდეგ და სწორი ვარჯიშის შემდეგ დაეტყობა ძაღლს ლამაზი სხეული.სწორი რაოდენობის ცილების მიღება მის იმუნიტეტსაც გაზრდის .

ცილები შედგება ამინომჟავებისგან ალბათ იცი . ძაღლის ორგანიზნი ნახევარს წარმოქმნის ნახევარი კი კვებისგან უნდა მიიღოს . ნებისმიერი აუცილებელი ამინომჟავის ნაკლებობამ შეიძლება გამოიწვიოს იმუნური სისტემის დასუსტება. ამან შეიძლება გამოიწვიოს ენერგიის ნაკლებობა, კანისა და ბეწვის ცუდი მდგომარეობა . ასევე ენერგიის და კუნთების სწორი აღდგენა ვერ შეძლოს .

იდეალურ შემთხვევაში, ბიოლოგიური ტიპის პროტეინები(ცილები) მიეცით ,მსგავსად შეიწოვება უფრო ადვილად ორგანიზმში . ალბათ იცი ბიოლოგიური ცილებია თევზი , ქათმის ხორცი , ბატკნის საქონლის და ა.შ. ხშირად დანამატებს და ვიტამინებს აძლევენ ვარჯიშისას ძაღლს ცილების მარაგის შესავსებად . მაგრამ მე რეკომენდაციას არ ვუწევ ყველა დანამატს და ეგ ცალკე თემაა რატომაც არ ვუწევ რეკომენდაციას და რატომაა ზოგი ეგ ვიტამინი ძაღლისთვის საშიში (აქ მოვიაზრებ იმ ვიტამინებს აძლევს ზოგი რასაც ბოდიბილდერები იღებენ ) . თუ მისცემ მიეცი მხოლოდ ის რაც ძაღლისთვისაა განკუთვნილი .

საუკეთესო ვარჯიშები :
ცურვა (10 წუთიანი ცურვა ერთი საათის სიარულის ტოლფასია.)
სიარული ან სირბილი ქვიშაზე ან წყლის ნაპირზე. (10 წუთი საკმარისზე მეტია იმისათვის, რომ თქვენმა ძაღლმა კარგად ივარჯიშოს)
სიმძიმის გაწევა (გააკეთებინეთ 30-დან 60 ნაბიჯი . დაასვენეთ 2 წუთი და გაიმეორეთ. თანდათან შეგიძლიათ გაზრდაც .)
კიბეზე ასვლა
ხტუნვა
Spring pole
Flirt pole
მოცემული ვარჯიშების ლიმიტი სწორად განსაზღვრეთ . დაუშვებელია ამ ვარჯიშების დიდხანს გაკეთება შეუსვენებლად . ყოველდღიურად მსგავსი ვარჯიშიც არ არის რეკომენდირებული მიეცით საშუალება ძაღლმა დაისვენოს და აღიდგინოს ერეგია .
          </motion.p>
      </div> 
      </div>




      <div className="home-containerBlog">
      <div className="image-column2">
            <img src={d} alt="My" className='blogphoto'/>
            </div>

            <div className="text-column2">

            <motion.h1
            initial={{ opacity: 0, x: -100 }}
            animate={{ opacity: 1, x: 0 }}
            transition={{ duration: 1 }}
          >
            როგორ მივაჩვიოთ ლეკვი ერთ ადგილზე მოსაქმებას ?
          </motion.h1>
          <motion.p
            initial={{ opacity: 0, x: 100 }}
            animate={{ opacity: 1, x: 0 }}
            transition={{ duration: 1 }}
          >
თუ თქვენ მიყვებით რამდენიმე მარტივ ნაბიჯს თქვენ შეძლებთ თქვენ ლეკვს ასწავლოთ მოცემული ბრძანება მარტივად და სტრესის გარეშე . 🐶💖 უპირველეს ყოვლისა განვიხილოთ ლეკვის ფსიქოლოგია . ყველა ლეკვს აქვს ინსტიქტი , რომ საკუთარი სათამაშო ტერიტორია და საჭმელი შეინარჩუნოს სუფთად . ისინი არ ისაქმებენ იმ ტერიტორიაზე სადაც თვლიან, რომ იძინებენ და იკვებებიან .

იქიდან გამომდინარე რომ მათ აქვთ პატარა შარდის ბუშტი რეკომენდირებულია ყოველ 2-3 საათში მოხდეს იმ ადგილზე მისი გაყვანა , სადაც გსურთ რომ მოისაქმოს . (ღამითაც კი ) მოცემულ მომენტში საუბარია პატარა ასაკის ლეკვებზე . ზრდასთან ერთად საათების საოდენობაც იზრდება .

კარგი იქნება თუ შეჩვევის პირველ დღეებში თქვენ დააყენებთ ტაიმერს და ყოველ ერთ საათში გაიყვანთ მას იმ ტერიტორიაზე სადაც გსურთ , რომ მოისაქმოს . აღნიშნულ ადგილზე გადაყვანისას ნუ დაუწყებთ ლეკვს თამაშს , თორემ აერევა თამაშის და მოსაქმების ადგილი . ამ მომენტში მნიშვნელოვანია დააიგნოროთ (იტრიალეთ მოცემულ ტერიტორიაზე ) და დაელოდეთ სანამ არ მოისაქმებს . როდესაც მოისაქმებს შეაქეთ , ამის შემდეგ გადაინაცვლეთ ისევ სათამაშო ტერიტორიაზე და კვლავ დააყენეთ ტაიმერი . (თუ არ მოისაქმა ამ პერიოდში ეს პრობლემას არ წარმოადგენს . გაიმეორეთ იგივე კვლავ რამდენიმე ხანში ) .

საერთოდ , როდესაც ლეკვებს მოსაქმების მოთხოვნილების სურვილი უჩნდებათ და გვინდა ამას მივხვდეთ მისი წინაპირობებია :
მიწის ყნოსვა 🐾,
ტერიტორიის გარშემო ტრიალი 🐾 ,
ახლახანს თუ გაიღვიძა 🐾 ,
ლეკვის ზონიდან თუ ახლახანს გამოუშვი 🐾,
თუ ჭამა ან დალია 🐾 ,
სათამაშოებთან თამაშობდა ადგა და სხვა საქმისკენ წავიდა 🐾,
იყო აღელვებული 🐾 ,
იყო ძალიან აქტიური 🐾.
თუ შეატყობთ ამ წინაპირობებს გადაიყვანეთ იმ ადგილზე სადაც გსურთ , რომ ისწავლოს მოსაქმება .

ასევე გახსოვდეთ შარდი ლეკვისთვის არის ნეონივით . ის ეუბნება "ეს ადგილი ტუალეტია" . ამიტომ თუ ის არასწორ ადგილზე მოისაქმებს უკლებლივ გაასუფთავეთ მშვიდად ტერიტორია.

შეცდომა, რასაც ხშირად უშვებენ პატრონები არის ის , რომ სჯიან ლეკვებს არასწორ ადგილზე მოსაქმებისთვის და შექმნილი აურზაურისთვის . სწავლების პროცესში გახსოვდეთ შეცდომა გარდაუვალია და არასდროს ეჩხუბოთ ან დასაჯოთ ლეკვი . პირველი მიზეზი ის ვერ მიხვდება წარსულში ჩადენილ ქმედებაზე თუ ეჩხუბებით. მეორე მიზეზი თუ დასჯით ,ის ამას მხოლოდ აღიქვამს , რომ თქვენს გარშემო არ უნდა მოისაქმოს . ამ დროს ხშირია რომ ლეკვები იპარებიან , რომ თავი დააღწიონ პატრონს და ჩუმათ მოისაქმონ .

მნიშვნელოვანია ძაღლს ჰქონდეს წვდომა მის მოსასაქმებელ ტერიტორიასთან . ძაღლებს ჩვევები და განრიგი უყვართ , ამიტომ მის ცხოვრებაში სწორ განრიგს დიდი მნიშვნელობა მიანიჭეთ . ამაში ვგულისხმობ კვების განრიგსაც . ნუ შეუცლით კვების განრიგს მუდმივად და ნურც შეუცვლით შეჩვეულ კვებას . თუ ეს აუცილებელი გახდა საჭმელი სწორად შეარჩიეთ , რადგან ისინი მგრძნობიარეები არიან გარკვეულ ინგრედიენტებთან . კვების განრიგის არევა გამოიწვევს მის მოსაქმების განრიგის არევას და ამისთვისაც მზად უნდა იყოთ .

გახსოვდეთ აპატიეთ შეცდომები და გამოიჩინეთ დიდი მოთმინება . ამ მომენტში ორივე საკუთარი თავის მაქსიმუმს აკეთებთ .
          </motion.p>
      </div> 
      </div>
</motion.div>
  );
};

export default blog;