import React from 'react';
import './Pages.css';
import { motion } from 'framer-motion';
import dog1 from '../assets/dog1.jfif';
import dog2 from '../assets/dog3.jfif';
import dog3 from '../assets/dog4.jpg';
import dog4 from '../assets/dog2.jfif';


const MyDogs = () => {
 
  return (

    <motion.div
    initial={{ opacity: 0, y: -50 }}
    animate={{ opacity: 1, y: 0 }}
    exit={{ opacity: 0, y: -50 }}
    transition={{ duration: 0.5 }}
  >






<div className="my-dogs-container">
        <div className="dog-card">
          <img src={dog1} alt="Dog 1" className="dog-image" />
          <div className="dog-description">
            <h2>ჯინა</h2>
            <p>ჯინა ყველაზე პირველი ძაღლი იყო. ის იყო ნალას და კრატოსის დედა. ჯინამ ჩვენს ოჯახში დიდი დრო გაატარა . ის საუკეთესო მეგობარი და ბრწყინვალე
              მეგობარი იყო . სიგიჟემდე უყვარდა ბავშვები და ყველანაირი ცხოველი . მეგობრობდა კურდღლებთან და სხვა ძაღლებთან მუდმივად . თითქოს პატარა ადამიანი იყო
              იმდენად სრულყოფილად ესმოდა . საოცარი კომპანიონი იყო. შეეძლო ევლო საბელის გარეშე ისე მშვიდად შენს გვერდით , რომ მის გარშემო რა ხდებოდა არ აინტერესებდა.
              ძალიან მშვიდი , წყნარი და კეთილი ძაღლი იყო. სამწუხაროდ ჯინაკო 8 წლის ასაკში გარდაიცვალა და დაგვტოვა. დიდი ტკივილი იყო მისი დაკარგვა დაგვიტოვა 
              საოცარი მოგონებები და თაობა , რომელსაც ახლა ვზრდით ნალა და კრატოსი .
            </p>
          </div>
        </div>

        <div className="dog-card">
          <img src={dog2} alt="Dog 2" className="dog-image" />
          <div className="dog-description">
            <h2>ნალა</h2>
            <p>ნალა მეორე ძაღლია ოჯახში სულ მალე 5 წლის გახდება . დედისგან სითბო და ბავშვების სიყვარული გამოჰყვა . ესმის უამრავი ბრძანება . ის არის ძალიან 
              აზარტული ძაღლი იმ ძაღლებს შორის , რომლებიც მყავს . შეუძლია დაახლოებით 2 მეტრამდე ხტუნვა და მისი აზარტულობის გამო ხშირად სიგიჟეებიც ჩაუდენია.
              მეორე სართულის აივნიდან გადამხტარა , რომ მის სათამაშოს ჩამოსკიდებოდა რომელიც ჰაერში ეკიდა . ხშირად ვარჯიშობდა 3 წლამდე . ერთად დავრბოდით და ერთად დავდიოდით 
              ლაშქრობებზე . ოჯახში ძიძა ძაღლის როლს ირგებს . ჩემი პატარა და ძმა ხშირად გადაურჩენია კრაზანის , ფუტკრის დაკბენას . ასევე წაქცევას . თამამა შემიძლია ვთქვა მფრინავი ძაღლია, როდესაც
              ვარჯიშობდა ადიოდა 3 მეტრა ხეებზე . ნალას ერთადერთი ლეკვი ყავს კიარა ამიტომაც ისიც ჩვენ ოჯახში დარჩა . იმს მიუხედავად , რომ ჯინა ყოველთვის მრავალშვილიანი 
              დედა იყო ხოლმე . ნალამ ყველა გაგვაოცა 2 წლის წინ, როდესაც ერთადერთი ლეკვი გვაჩუქა.
            </p>
          </div>
        </div>

        <div className="dog-card">
          <img src={dog3} alt="Dog 3" className="dog-image" />
          <div className="dog-description">
            <h2>კრატოსი</h2>
            <p>კრატოსი ოჯახში მეორე ძაღლი . ახლახანს 4 წლის გახდა . ნალა და კრატოსი საუკეთესო მეგობრებივით არიან . არასდროს უჩხუბიათ და თითქოს ყოველთვის 
              ერთმანეთს სასწაულად უგებენ . კრატოსის დაბადების შემდეგ მე და ნალას კომპანია შეგვემატა ლაშქრობებში და ხშირად ვსეირნობდით ერთად ხოლმე. კრატოსი გამოირჩევა მისი 
              თვისებებით . ის არის მშვიდი და გაწონასწორებული ფსიქიკის . ნალასგან განსხვავებით დიდად ხტუნვა და ვარჯიში არ უყვარს , მაგრამ მისი საყვარელი სათამაშო ბურთია . მაგრამ 
              სისწრაფეში ყოველთვის ნალა სჯობნის რის გამოც ბურთზე პირველი ის მიდის და კრატოსი უკან გაბუსხული ბრუნდება :დდ . 
            </p>
          </div>
        </div>

        <div className="dog-card">
          <img src={dog4} alt="Dog 4" className="dog-image" />
          <div className="dog-description">
            <h2>კიარა</h2>
            <p>კიარა ის ერთადერთი ლეკვია , რომელიც ნალას ეყოლა. სულ მალე 3 წლის გახდება . ყველასგან იმით გამოირჩევა რომ ყველაზე მეტად დიდი რაოდენობის 
              ბრძანებები მას ესმის , ამიტომაც საოცარი კომპანიონის როლს ასრულებს . იმდენად გაწონასწორებული ფსიქიკის ძაღლის სხვა ძაღლების აგრესიის მიუხედავად ის აგრესიას
              არავის მიმართ გამოხატავს და თითქმის ყურადღებას არ აქცევს . ოჯახში მასხარა ძაღლის როლი აქვს მორგებული . ყველა სისულელე მან უნდა გააკეთოს . იქცევა ისე სასაცილოთ 
              ან აკეთებს ისეთ რაღაცეებს გამორიცხულია დღე არ გაგიფერადოს. ბავშვობიდან ძალიან უყვარს წყალი ამიტომ მდინარეში და აუზში მუდმივად დაცურავს ხოლმე . ცოტა გასაკვირია 
              რადგანაც წყალი არც დედამის და არც მამამის უყვარს . ლეკვობიიდან იმდენად მსუქანი ლეკვი იყო ვეტერინარებს ეგონათ რომ ვერ გაივლიდა მაგრამ მისი წონის მიუხედავად კურდღელივით
              დახტოდა ხოლმე . 1 წლის წინ საშინელი დაავადება დაამარცხა. 3 ცნობილი კლინიკის ექიმები დაძინებას გვირჩევდნენ . მაგრამ ვიცოდით ყველამ , რომ იმდენად ძლიერი იყო 
              ყველაფერს გაუძლებდა და სასწაულებრივად გამოჯანმრთელდა , როდესაც ორგანიზმში თითქმის სისხლი არ ჰქონდა დარჩენილი და ანემიის ბოლო ფაზაზე ვიყავით . ახლა კი ისევ 
              ყველაზე პუტკუნა და მასხა ლეკვია . სადაცაა 3 წლის კი გახდება , მაგრამ გონებით ისევ ლეკვია და ხშირად ამიტომაც ვეძახით პატარა სულელ ლეკვს . 
            </p>
          </div>
        </div>
      </div>









    </motion.div>
  );
};

export default MyDogs;